Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པའི་ཤེས་རབ་ཀྱིས་ནི་དེ་ལྟ་བུར་མི་གཟིགས་ཀྱི་དངོས་པོ་མེད་པར་ངོ་བོ་ཉིད་ཁོ་ནར་གཟིགས་སོ།
en: A tathāgata’s wisdom does not view it like that; it views it solely as the nonexistence of an intrinsic nature.

source: །དེ་ལྟར་ན་སེམས་ཆེན་པོར་གྱུར་པ་ལ་སེམས་ཆེན་པོར་འགྱུར་བ་མེད་པས་འདིའི་དངོས་པོ་མེད་པར་རབ་ཏུ་མཁྱེན་པ་ལ་དེ་སྐད་ཅེས་བྱའོ།
en: Since this is the case, it is saying that where “a thought has become big” its becoming big does not exist, so they “thoroughly know” of it that it is a nonexistent thing. “

source: །སེམས་ཚད་མེད་པ་ཞེས་བྱ་བས་འདི་སྟོན་ཏེ། སེམས་ཅན་དེ་བདག་གི་སེམས་དེ་གནས་པ་མ་ཡིན་པ་དང་རྒྱུན་ཆད་པ་མ་ཡིན་པ་དང་། ཡོངས་སུ་གནས་པ་མ་ཡིན་པ་དང་། ཡོངས་སུ་མི་གནས་པ་མ་ཡིན་པར་ཡང་དག་པར་རྗེས་སུ་གཟིགས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་འདི་སྐད་བསྟན་ཏེ། ཚད་མེད་པ་ནི་ཁྱབ་པར་གནས་པའམ།
en: Immeasurable thought” is explained by saying they “view that thought of… beings… as not there, as not interrupted, as not fixed, and as not not fixed,” and so on.

source: དབྱིབས་ཀྱི་དབང་གིས་འགྱུར་གྲང་ན།
en: This teaches the following: You can suppose it is “immeasurable” in the sense that it is pervasive or is a basic element.

source: དེ་བཞིན་གཤེགས་པ་ནི་དེ་ལྟ་བུའི་ཚད་མེད་པ་འདི་སེམས་མི་གཟིགས་ཀྱི་སེམས་ཐམས་ཅད་མི་གནས་པ་དང་། རྟེན་མེད་པར་གཟིགས་ཏེ།
en: The tathāgatas do not view an immeasurable thought like that; rather, they view all thoughts as having no fixed position and being without a foundation.

source: དེ་ལྟར་གཟིགས་པ་ན་ཚད་མེད་པའི་སེམས་ཡང་དག་པ་ཇི་ལྟ་བ་ཉིད་དུ་རབ་ཏུ་མཁྱེན་ཏོ་ཞེས་བྱའོ།
en: When they view it like that, they “know an immeasurable thought… for what it is.” “[

source: །སེམས་དེ་མཚན་ཉིད་མེད་པ།
en: They] view that thought… as without a mark and separated from an intrinsic nature.”

source: ངོ་བོ་ཉིད་དང་བྲལ་བར་གཟིགས་ཞེས་བྱ་བ་ནི་ངོ་བོ་ཉིད་མེད་པ་དང་། མཚན་ཉིད་མེད་པའི་ཕྱིར་བསྟན་པར་མི་ནུས་པས་བསྟན་དུ་མེད་པར་གཟིགས་སོ།
en: Because it has no intrinsic nature and no mark it cannot show itself, so they view it as “a thought… that does not show itself.” “

source: །སྤྱན་ལྔ་ལ་སེམས་དེ་དག་སྣང་བར་མི་འགྱུར་ཞེས་བྱ་བ་ནི་བསགས་པའི་ཕྱིར་སེམས་ཏེ། ཀུན་བརྟགས་པ་ལ་བྱའོ། །དེ་ཡང་དེའི་བདག་ཉིད་ཀྱིས་ཡོད་པ་མ་ཡིན་ཏེ། མེད་པ་ཉིད་ཀྱི་ཕྱིར་དེ་ཁོ་ན་གཟིགས་པ་རྣམས་ཀྱི་སྤྱན་ལ་སྣང་བར་མི་འགྱུར་རོ།
en: Those thoughts… are not even visible to the five eyes”— a thought forms, so take it as falsely imagined; furthermore, because that does not exist in itself, it is a nonexistent thing, so it does not appear to the eyes of those who see true reality.

source: །དེ་བས་ན་སེམས་ནི་བལྟར་མེད་པའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །།བམ་པོ་ཉི་ཤུ་གཅིག་པ།
en: Hence, “an invisible thought.”

source: སེམས་གསལ་བ་དང་།
en: That is the meaning. “

source: བྱིང་བ་དང་བཙུམས་པ་དང་། བཀྲམ་པ་ཞེས་བྱ་བ་ནི་མུ་སྟེགས་ཅན་ལྟ་བ་ཕྱིན་ཅི་ལོག་པ་རྣམས་སེམས་རྟག་པར་འཛིན་པའི་དབང་གིས་ནི་གསལ་བའོ། །ཆད་པར་འཛིན་པའི་དབང་གིས་ནི་བྱིང་བའོ།
en: Thoughts that are clear, dull, abridged, and expanded”— they know “clear” thoughts in the sense of those of tīrthikas who make philosophical errors grasping at permanence; the “dull” in the sense of those grasping at nihilism; the “abridged” in the sense of those who over-negate; and the “expanded” in the sense of those who over-reify “for what they are.” “

source: །སྐུར་པ་འདེབས་པའི་དབང་གིས་ནི་བཙུམས་པའོ། །སྒྲོ་འདོགས་པའི་དབང་གིས་ནི་བཀྲམ་པ་སྟེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཁྱེན་ཏོ། །གཟུགས་ལ་བརྟེན་ཅེས་བྱ་བ་ནི་ཕུང་པོ་ལྔ་ལས་བརྩམས་ཏེ་སྐྱེའོ་ཞེས་བྱ་བར་བསྟན་པའོ།
en: Based on form” explains arising based on the five aggregates. “

source: །དེ་ནི་གཟུགས་ལ་གནས་པའོ་ཞེས་བྱ་བ་ནི་གཟུགས་ལ་གནས་ཏེ་སེམས་འཕྲོ་བ་དང་། གཟུགས་བདག་གོ་ཞེས་མངོན་པར་ཞེན་ནས་སྨྲའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Refers to form” means a thought has “been emitted” with form as its reference point, and they have settled down on it and say, “I am form.” “

source: །དེ་བཞིན་དུ་དེ་ནི་ཚོར་བ་ལ་གནས་པ་ཞེས་བྱ་བ་ལ་སོགས་པ་ལ་ཡང་སྦྱར་བར་བྱའོ།
en: Connect this in the same way also with” refers to “feeling” and so on.

source: །དེ་བཞིན་དུ་ལྟ་བར་གྱུར་པ་ལས་སེམས་འཕྲོ་བ་ལ་སོགས་པ་ཡང་བསྟན་ནས། ད་ནི་རྣམ་པར་རྟོག་པའི་སྤྲོས་པའི་འཕྲོ་བ་ལ་སོགས་པས་བསྟན་པའི་ཕྱིར་གསུངས་པ། རབ་འབྱོར་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་བརྟེན་ནས་གཟུགས་མཁྱེན་ཏོ།
en: Similarly, having taught that thoughts that have arisen from wrong views have “been emitted” and so on, now, to reveal those that have been emitted and so on from conceptual thought constructions, it says, “Furthermore, Subhūti, thanks to this deep perfection of wisdom the tathāgatas know form.

source: །གཟུགས་ཇི་ལྟར་མཁྱེན་ཞེ་ན་ཇི་ལྟར་དེ་བཞིན་ཉིད་དུ་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་ལ།
en: How do they know form? They know it just as they know suchness—without distortion, without conceptualization,” and so on.

source: མཚན་མ་མེད་ཅིང་ཞེས་བྱ་བ་ལ་སོགས་པ་རྣམ་པ་དྲུག་གིས་ཆོས་ཐམས་ཅད་དེ་བཞིན་ཉིད་དུ་བདག་ཉིད་དུ་མཁྱེན་ཏོ། །དེ་ལ་འགྱུར་བ་མེད་པ་ཞེས་བྱ་བ་ནི་གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་ཀྱི་ཕྱིར་རོ། །རྣམ་པར་རྟོག་པ་མེད་ཅེས་བྱ་བ་ནི་མ་ནོར་བ་དེ་བཞིན་ཉིད་ཀྱི་ཕྱིར་རོ།
en: In six different ways they know all phenomena in their nature as “suchness.”

source: །མཚན་མ་མེད་པ་ནི་ཡང་དག་པའི་མཐའི་ཕྱིར་རོ། །ལྷུན་གྱིས་གྲུབ་པ་ནི་གསལ་བར་བྱེད་པ་མེད་པའི་ཕྱིར་རོ། །སྤྲོས་པ་མེད་པ་ནི་ངོ་བོ་ཉིད་ཀྱིས་དབེན་པའི་ཕྱིར་རོ། །དེ་དམིགས་སུ་མེད་པ་ནི་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཕྱིར་རོ། །ད་ནི་ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པ་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་ཐམས་ཅད་དང་། འཕགས་པའི་གང་ཟག་ཐམས་ཅད་དང་།
en: There they know that they are “without distortion,” because of unaltered suchness; “without conceptualization,” because of unmistaken suchness; “without a causal sign,” because of the very limit of reality; “without effort,” because there is no illumination; “without thought construction,” because they are isolated from an intrinsic nature; “and without apprehending anything,” because of the nonexistence of an intrinsic nature.

source: འཕགས་པའི་ཆོས་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པ་ཡང་དེ་བཞིན་ཉིད་དུ་ཐ་མི་དད་པའི་ཕྱིར། དེ་བཞིན་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དུ་ཆོས་ཐམས་ཅད་གཉིས་སུ་མེད་པར་སྟོན་ཏེ། རབ་འབྱོར་དེ་ལྟར་ན་སེམས་ཀྱི་གསལ་བ་དང་། བྱིང་བ་དང་། བཀྲམ་པ་དང་། བཙུམས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་ནི་ཕུང་པོ་དང་ཁམས་དང་།
en: Now, because all phenomena with outflows and without outflows, that are ordinary and extraordinary, and all superior persons and all superior dharmas, even the tathāgatas, are not broken apart in suchness, with “therefore, Subhūti, the suchness of thoughts… that are clear, dull, abridged, and expanded is the suchness of the aggregates, constituents, sense fields, dependent origination,” and so on, it reveals that as suchness, their intrinsic nature, all phenomena are not different.

source: སྐྱེ་མཆེད་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པས་སོ། །ལྷའི་བུ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་དེ་ཞེས་བྱ་བ་ནི་བྱིས་པའི་སྤྱོད་ཡུལ་དུ་གྱུར་པ་ཀུན་བརྟགས་པའི་ཆོས་རྣམས་དང་།
en: Explanation of Chapters 43 to 45 Marks “Gods, this perfection of wisdom is deep because it is marked by emptiness.”

source: བྲལ་བ་ཉིད་ལ་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་ཅེས་བྱའོ།
en: The separation from falsely imagined phenomena that are the objects in the range of fools is “marked by emptiness.”

source: །རྟོག་པ་དང་རྣམ་པར་རྟོག་པའི་སྤྲོས་པ་ཐམས་ཅད་ཀྱི་མཚན་མ་མེད་ཅིང་ཤིན་ཏུ་ཞི་བའི་ཕྱིར་མཚན་མ་མེད་པའི་མཚན་ཉིད་ཅེས་བྱའོ།
en: The absence and total extinguishing of the causal signs of mental construction and conceptual thought projections is “marked by signlessness.”

source: །རྣམ་པར་རྟོག་པའི་སྨོན་པ་ཐམས་ཅད་ཡོངས་སུ་བཏང་བའི་ཕྱིར་ཕྱིས་སྨོན་པའི་མཚམས་མི་སྦྱོར་བ་ནི་སྨོན་པ་མེད་པའི་མཚན་ཉིད་ཅེས་བྱའོ།
en: Not joining up later with what has been wished for, because all conceptualized wishes have been forsaken, is “marked by wishlessness.”

source: །རྒྱུ་དང་རྐྱེན་དང་འབྲས་བུར་རྣམ་པར་རྟོག་པའི་སྤྲོས་པ་ཐམས་ཅད་རྒྱུན་ཆད་ཅིང་སྐྱེ་བ་ལ་སོགས་པ་དང་བྲལ་བའི་ཕྱིར་འདུས་མ་བྱས་པའི་གནས་སྐབས་ནི་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པའི་མཚན་ཉིད་ཅེས་བྱའོ།
en: The uncompounded state is “marked by the absence of production and stopping” because all thought constructions conceiving of cause, condition, and result are severed. It is separated from production and so on.

source: །གྱུར་པ་རྣམ་པ་བཞིས་གནས་གྱུར་ཅིང་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་ཉིད་ལ་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་མཚན་ཉིད་ཅེས་བྱའོ།
en: The absolutely purified state when there is a transformation of the basis through the four transformations is “marked by the absence of defilement and the absence of purification.”

source: །སྒྱུ་མ་དང་རྨི་ལམ་དང་མིག་ཡོར་ལ་སོགས་པ་བཞིན་དུ་ཡོངས་སུ་མ་གྲུབ་ཅིང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་ཅེས་བྱའོ།
en: Like an illusion, a dream, a mirage, and so on, which are not thoroughly established and are nonexistent, a nonexistent thing is “marked by the nonexistence of an intrinsic nature.”

source: །ཡོངས་སུ་རྟོག་པ་དང་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་དང་བྲལ་ཞིང་དོན་དམ་པར་བརྗོད་དུ་མེད་པས་ནམ་མཁའ་བཞིན་དུ་གང་དུ་ཡང་གནས་པ་མེད་པ་ལ་མི་གནས་པའི་མཚན་ཉིད་ཅེས་བྱའོ།
en: What has no standing anywhere, like space separated from all false imagination and thought construction, ultimately inexpressible, is “marked by the absence of a foundation.”

source: །སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་དང་། དབུས་ཀྱི་མཐའ་རྣམ་པར་སྤངས་པའི་ཕྱིར་ཡོད་པ་དང་མེད་པའི་དངོས་པོ་དང་བྲལ་བ་རང་བཞིན་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཉིད་ལ་ཆད་པ་མེད་པ་དང་། རྣམ་པར་རྟག་པ་མེད་པའི་མཚན་ཉིད་ཅེས་བྱའོ།
en: Because a prior limit, a later limit, and a middle have been abandoned, the natural state of nirvāṇa separated from an existent thing and a nonexistent thing is “marked by the absence of annihilation and of going on and on forever.”

source: །ཐ་དད་པའི་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་སྤངས་པས་གཉིས་སུ་མེད་པ་ཐ་དད་པ་དང་གཅིག་པ་དང་བྲལ་བ་ཉིད་ནི་དོན་གཅིག་པ་མ་ཡིན་པ་དང་། དོན་ཐ་དད་པ་མ་ཡིན་པའི་མཚན་ཉིད་ཅེས་བྱའོ།
en: The nondual state separated from difference and unity is “marked by the absence of unity and the absence of difference” because all conceptualizations of difference have stopped.

source: །རྩོལ་བ་ཐམས་ཅད་སྤངས་པས་གསལ་བར་བྱེད་པ་མེད་པ་ལ་བྱེད་པ་མེད་པའི་ཕྱིར། འགྲོ་བ་དང་འོང་བ་དང་བྲལ་བ་ཉིད་ནི་འོང་བ་མེད་པ་དང་འགྲོ་བ་མེད་པའི་མཚན་ཉིད་ཅེས་བྱའོ།
en: The state separated from coming and going is “marked by the absence of coming and absence of going” because all effort has been abandoned, illuminating does not exist, and an act of doing something does not exist.

source: །རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཐམས་ཅད་དང་བྲལ་བས་མཚན་ཉིད་མེད་པའི་བདག་ཉིད་དུ་གནས་པ་ནི་ནམ་མཁའི་མཚན་ཉིད་ཅེས་བྱའོ།
en: Because everything is totally separated from all of its own characteristic marks, the place constituted by the unmarked is “marked by space.”

source: །དེ་ཡང་དེ་བཞིན་གཤེགས་པས་འཇིག་རྟེན་གྱི་བརྡར་བཀའ་སྩལ་ཏེ་དོན་དམ་པར་ནི་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ནི་བརྗོད་དུ་མེད་པའི་མཚན་ཉིད་དུ་གསུངས་པའོ།
en: Furthermore, “the Tathāgata uses the conventional label as an ordinary conventional term, but not as an ultimate one” says it is marked by being inexpressible. “

source: །ལྷའི་བུ་དག་མཚན་ཉིད་དེ་དག་ནི་ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་གཞན་དུ་བྱ་བར་མི་ནུས་སོ་ཞེས་བྱ་བ་ནི་མི་འགྱུར་བར་ཡོངས་སུ་གྲུབ་པ་དང་། ཕྱིན་ཅི་མ་ལོག་པར་ཡོངས་སུ་གྲུབ་པས་ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་དུ་གསུངས་པའོ།
en: Gods, the world with its gods and humans cannot alter those marks” is saying that it is marked as thoroughly established because it is thoroughly established as being without alteration and thoroughly established as being without error. “

source: །ལྷའི་བུ་དག་མཚན་ཉིད་ནི་མཚན་ཉིད་གཞན་དུ་མི་བྱེད་དོ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ཀྱིས་དེ་བཞིན་ཉིད་རྣམ་པར་འཁྲུག་པར་མི་བྱེད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Gods, a mark does not make a mark into something else” means suchness does not disturb suchness. “

source: །མཚན་ཉིད་ནི་མཚན་ཉིད་མི་ཤེས་སོ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ཀྱིས་དེ་བཞིན་ཉིད་མི་ཤེས་ཏེ་ཇི་ལྟར་ནམ་མཁས་ནམ་མཁའ་མི་ཤེས་པ་བཞིན་ནོ།
en: A mark does not know a mark.” Suchness does not know suchness, just as space does not know space. “

source: །མཚན་ཉིད་ནི་མཚན་ཉིད་མེད་པ་མི་ཤེས་སོ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་ཀྱིས་ཀུན་བརྟགས་པ་མི་ཤེས་ཏེ།
en: A mark does not know the absence of a mark.”

source: ཇི་ལྟར་ནམ་མཁའ་རི་བོང་གི་རྭ་མི་ཤེས་པ་བཞིན་ནོ།
en: Suchness does not know a falsely imagined phenomenon, just as space does not know a rabbit’s horns. “

source: །མཚན་ཉིད་མེད་པ་ནི་མཚན་ཉིད་མི་ཤེས་སོ་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པས་དེ་བཞིན་ཉིད་མི་ཤེས་ཏེ།
en: The absence of a mark does not know a mark.”

source: ཇི་ལྟར་རི་བོང་གི་རྭས་ནམ་མཁའ་མི་ཤེས་པ་བཞིན་ནོ།
en: A falsely imagined phenomenon does not know suchness, just as a rabbit’s horns do not know space. “

source: །མཚན་ཉིད་མེད་པས་མཚན་ཉིད་མི་ཤེས་སོ་ཞེས་བྱ་བ་ཀུན་བརྟགས་པས་ཀུན་བརྟགས་པ་མི་ཤེས་ཏེ།
en: And the absence of a mark does not know the absence of a mark.”

source: ཇི་ལྟར་རི་བོང་གི་རྭས་རི་བོང་གི་རྭ་མི་ཤེས་པ་བཞིན་ནོ།
en: A falsely imagined phenomenon does not know a falsely imagined phenomenon, just as a rabbit’s horns do not know a rabbit’s horns. “

source: །མཚན་ཉིད་གང་ཡིན་པ་དང་མཚན་ཉིད་མེད་པ་གང་ཡིན་པ་གཉིས་ཀ་ལ་ཡང་གང་གིས་ཤེས་པར་བྱེད་པའི་ངོ་བོ་ཉིད་མེད་དོ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་རྣམ་པར་མི་རྟོག་པ་དང་ལྷུན་གྱིས་གྲུབ་པ་ཉིད་དང་སྤྱོད་པ་མེད་པའི་ཕྱིར་རབ་ཏུ་ཤེས་པའི་ངོ་བོ་ཉིད་མེད་དེ་ཀུན་བརྟགས་པ་རྣམས་མེད་པའི་ཕྱིར་རོ།
en: Therefore that mark, and that absence of a mark, and also both, do not have… the intrinsic nature of that which might cause knowing.” An intrinsic nature of perceiving does not exist because suchness is nonconceptual, effortless, and does not stir, because a falsely imagined phenomenon does not exist. “

source: །གང་གིས་ཤེས་པར་བྱེད་ཅེས་བྱ་བ་ནི་ཤེས་པ་ལ་སོགས་པས་སོ།
en: That which might make known” is consciousness and so on. “

source: །གང་ཤེས་པར་བྱེད་ཅེས་བྱ་བ་ནི་གང་ཟག་གམ་ཆོས་སོ།
en: Who might know” is a person or a dharma. “

source: །གང་ལ་ཤེས་པར་བྱེད་ཅེས་བྱ་བ་ནི་གང་ཟག་གམ་ཆོས་གཞན་ལའོ།
en: To whom it might be made known” is another person or a dharma. “

source: །ལྷའི་བུ་དག་མཚན་ཉིད་འདི་དག་ནི་གཟུགས་ཀྱིས་མངོན་པར་འདུས་བྱས་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་མཚན་ཉིད་སྟོན་ཏོ།
en: Gods, those marks are not occasioned by form,” and so on, reveals that it is marked by not occasioning anything. “

source: །མཚན་ཉིད་ཐམས་ཅད་ནི་མཚན་ཉིད་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་ལ་སོགས་པ་སྔར་སྨོས་པ་རྣམས་དང་། འདུས་བྱས་དང་། འདུས་མ་བྱས་པ་ཐམས་ཅད་དང་ཀུན་བརྟགས་པའི་མཚན་ཉིད་ཀྱིས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Because all marks have no mark”— because the aforementioned emptiness, signlessness, and so on, and all compounded and uncompounded phenomena, are marked as falsely imagined phenomena is the meaning. “

source: །དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་མ་བྱུང་ཡང་རུང་ཞེས་བྱ་བ་ལ་སོགས་པས་ཆོས་གནས་པའི་མཚན་ཉིད་གསུངས་པའོ།
en: Whether the tathāgatas arise or whether the tathāgatas do not arise,” and so on, is speaking about the defining mark of phenomena remaining in the same state. “

source: །མཚན་ཉིད་ཀྱི་དབྱིངས་ནི་མཚན་ཉིད་མེད་པའི་དབྱིངས་ཇི་ལྟ་བ་བཞིན་དུ་གནས་པ་ཉིད་དེ།
en: The element of marks simply remains as it really is, the element of no marks.

source: དེ་ནི་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཞེས་བྱ་བ་ནི་མཚན་ཉིད་ཀྱི་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་མེད་པའི་ཕྱིར་མཚན་ཉིད་མེད་པའི་དབྱིངས་ཞེས་བྱའོ།
en: A tathāgata has perfectly and fully awakened to that.” It is called “the element of no marks” because all conceptualizations of a mark are absent. “

source: །དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱའོ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་དུ་ཐུགས་སུ་ཆུད་པའམ།
en: Therefore a tathāgata is called a ‘tathāgata.’ ”

source: དེ་བཞིན་ཉིད་ཐུགས་སུ་ཆུད་པ་ལ་ངེས་པའི་ཚིག་གིས་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱའོ།
en: Through a creative explanation they are called “tathāgatas” because they have realized as suchness or because they have realized suchness. “

source: །དེ་བཞིན་གཤེགས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་དག་པར་རབ་ཏུ་བསྟན་པས་མཚན་ཉིད་ཐམས་ཅད་ཡང་དག་པར་རབ་ཏུ་མཁྱེན་ཞེས་བྱ་བ་ནི། ལྷའི་བུ་དག་སྟོང་པ་ཉིད་ཀྱང་མཚན་ཉིད་དང་མཚན་མ་མེད་པའི་མཚན་ཉིད་ཡིན་པའི་ཕྱིར། འདི་ནི་ཟབ་པའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་སྔར་སྨོས་པ་སྟོན་ཏོ།
en: The Tathāgata has given an exposition of all marks by giving an exposition of the perfection of wisdom” is indicating the earlier statement, “Gods, this is deep because it is marked by emptiness, it is marked by signlessness,” and so on. “

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་མཚན་ཉིད་ཐམས་ཅད་རབ་ཏུ་དབྱེ་བ་མཛད་དེ་ཞེས་བྱ་བ་ནི་དོན་དམ་པ་རྣམ་པར་མི་རྟོག་པ་དེ་ལྟ་བུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་སེམས་ཅན་རྣམས་ལ་ཕན་གདགས་པའི་ཕྱིར་ཀུན་རྫོབ་ཀྱི་མཚན་ཉིད་རྣམས་བཤད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Having fully awakened to unsurpassed, perfect, complete awakening… [he] has differentiated all the marks” means that even though they have fully awakened to such a nonconceptual ultimate they still explain the conventional marks for the benefit of beings. “

source: །གཟུགས་ནི་གཟུགས་སུ་རུང་བའི་མཚན་ཉིད་དེ་ཞེས་བྱ་བ་ལ་སོགས་པས་ནི་ཀུན་རྫོབ་ཀྱི་མཚན་ཉིད་རྣམས་སྟོན་ཏོ།
en: The mark of form is something that can show itself,” and so on, teaches the conventional defining marks.

source: །འདི་ལ་བྱས་པ་གཟོ་བ་དང་བྱས་པ་ཚོར་བ་ནི་བདག་གིས་འདི་བྱས་སོ།
en: Appreciation and gratitude [The tathāgatas] “have appreciation and a feeling of gratitude” for this [perfection of wisdom].

source: །བདག་གིས་འདི་ཁས་བླངས་སོ་ཞེས་བྱ་བར་བདག་གིས་བྱས་པ་དང་། བསྒྲུབ་པར་རྟོགས་པའི་ཕྱིར་རོ།
en: They think ‘We have done this and we have asserted this’ because they realize what they have done and achieved. “

source: །མ་བྱས་པ་དང་འགྱུར་བ་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཞེས་བྱ་བ་ནི་སུས་ཀྱང་མ་བྱས་པའི་ཆོས་རྣམས་མ་བྱས་པའི་བདག་ཉིད་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའོ།
en: Fully awakened to all dharmas as not done and not changed”— they have “fully awakened” to dharmas constituted by what has not been done—that nobody has done.

source: །འགྱུར་བ་མེད་པ་ནི་མི་འགྱུར་བ་མེད་པར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཞེས་བྱ་བ་ནི་མི་འགྱུར་བའི་བདག་ཉིད་དུ་མཁྱེན་པའོ།
en: As for “not changed,” they have fully awakened without distortion; they know them as unchanging. “

source: །ལུས་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་ནི་ལུས་མེད་པ་ཁོག་པ་མེད་པ་གཟུགས་མེད་པ་ཉིད་དོ།
en: Because there is no body”— this is the nonexistence of a body, the nonexistence of an interior, formlessness.

source: །རབ་འབྱོར་དེ་ལྟར་ན་ལུས་མེད་ཅིང་ཁོག་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པས་མ་བྱས་པ་མཁྱེན་པ་དང་།
en: Therefore, Subhūti, the nonexistence of a body, this interior, is “the Tathāgata’s cognizance of what has not been done, and acknowledgment of what has not been done.”

source: མ་བྱས་པ་རིག་པའོ་ཞེས་བྱ་བ་ནི་འདུས་མ་བྱས་ཀྱི་མཚན་ཉིད་མཁྱེན་པས་མ་བྱས་པ་མཁྱེན་པའོ།
en: He is cognizant of what has not been done because he is cognizant of the mark of uncompounded phenomena. “

source: །དོན་དམ་པར་འབྱུང་བ་མེད་པའི་མཐུས་ཡེ་ཤེས་བྱས་པ་མེད་པ་ཆོས་ཐམས་ཅད་ལ་ཞུགས་སོ་ཞེས་བྱ་བ་ལ་དོན་དམ་པ་བྱུང་བ་མེད་པའི་མཐུས་ཞེས་བྱ་བ་ནི་དོན་དམ་པ།
en: Furthermore, Subhūti, thanks to the perfection of wisdom, on account of the force of ultimately not originating, the unmade transcendental knowledge has engaged with all dharmas.” “

source: མ་སྐྱེས་མ་བྱུང་བའི་དབང་གིས་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: On account of the force of ultimately not originating” means based on the ultimate being unproduced and unoriginated.

source: །དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ནི་ཡོངས་སུ་གྲུབ་པའི་ཆོས་ཀྱི་སྐུའི་མཚན་ཉིད་ཡིན་པས་མ་བྱས་པ་སྟེ། དེ་བས་ན་དེ་བཞིན་གཤེགས་པ་ནི་མ་བྱས་པ་མཁྱེན་པའོ་ཞེས་བྱ་བར་སྟོན་ཏོ།
en: It is teaching that the transcendental knowledge of the tathāgatas is the mark of the thoroughly established dharma body and hence is “unmade,” so the Tathāgata cognizes what has not been done. “

source: །བཅོམ་ལྡན་འདས་གང་གི་ཚེ་ཆོས་ཐམས་ཅད་སྐྱེད་པ་པོ་མ་མཆིས་ཤིང་མཐོང་བ་པོ་མ་མཆིས་པ་ཞེས་བྱ་བ་ནི་མི་སྐྱེད་པས་ན་སྐྱེད་པ་པོ་མེད་པ་སྟེ། དེ་བས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྐྱེད་པའོ་ཞེས་བྱ་བ་ནི་མི་མཐོང་ངོ་། །མཐོང་བར་མི་བྱེད་པས་མཐོང་བ་པོ་མེད་པ་སྟེ། དེ་བས་ན་འཇིག་རྟེན་སྟོན་པའོ་ཞེས་བྱ་བ་མི་མཐོང་ངོ་ཞེས་སྟོན་ཏོ།
en: Lord, when all dharmas are not producers and are not seers” is teaching that there has been no production so there is no producer, therefore it is not feasible that “the perfection of wisdom gives birth”; it does not cause seeing so there is no seer, so it is not feasible that it “reveals the world.” “

source: །རབ་འབྱོར་དེ་དེ་བཞིན་ནོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ཆོས་ཐམས་ཅད་སྟོང་པ་དང་།
en: Exactly so, Subhūti, exactly so!”

source: གསོ་བ་དང་གསོག་ཡིན་པའི་ཕྱིར་སྐྱེད་པ་པོ་མེད་པ་དང་། མཐོང་བ་པོ་མེད་པ་བདེན་མོད་ཀྱི། དོན་འདི་ལྟ་བུ་ཤེས་པ་འཇིག་རྟེན་ན་སུ་ཡང་མེད་དེ།
en: and so on is teaching “because all dharmas are empty, ring hollow, are in vain… are not producers and are not revealers,” that it is true, and in the ordinary world there is nobody who knows such a reality.

source: ངས་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལ་བརྟན་ནས། དོན་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། དེ་ལྟ་བས་ན་དེར་བསྐྱེད་པ་ཡིན་ཞིང་སྟོན་པ་ཡིན་ནོ་ཞེས་དེ་སྐད་སྟོན་ཏེ།
en: It is teaching “Still, he, thanks to the perfection of wisdom, has fully awakened to this reality as it actually is, therefore it has given birth to him and reveals the world.”

source: འདི་ནི་བསྟོད་པའི་ཚིག་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: He intends this as a statement of praise. “

source: །གཟུགས་མཐོང་བ་མེད་པའི་ཕྱིར་སྟོན་པའོ་ཞེས་བྱ་བ་ནི་གང་གི་ཕྱིར་གཟུགས་ངས་མ་མཐོང་བ་དེའི་ཕྱིར་དེ་སྟོན་པའོ།
en: It reveals it, moreover, because form is not seen.” Because he does not see form, therefore it reveals it.

source: །གལ་ཏེ་གཟུགས་མཐོང་བར་གྱུར་ན་ནི་རབ་རིབ་ཅན་བཞིན་དུ་ཡང་དག་པ་མ་ཡིན་པའི་དོན་མཐོང་བས་དེ་སྟོན་པར་ཡང་མི་འགྱུར་རོ།
en: Were he to have seen form, he would have seen reality imperfectly, like somebody with a visual distortion, so it also would not reveal it. “

source: །རབ་འབྱོར་ནམ་གཟུགས་ལ་དམིགས་པའི་རྣམ་པར་ཤེས་པ་མི་འབྱུང་བའི་ཚེ་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་རབ་རིབ་ཅན་ལ་སྐྲ་ཤད་འཛིངས་པ་ལ་སོགས་པ་ལ་དམིགས་པའི་རྣམ་པར་ཤེས་པ་འབྱུང་བ་དེ་ཕྱིས་མི་འབྱུང་བར་གྱུར་པ་དེ་ནས་མཐོང་བ་ཡོངས་སུ་དག་པ་ཞེས་བྱ་བར་འགྱུར་ཏེ།
en: Subhūti, when a consciousness with form as objective support does not arise”— when a consciousness with bristly strands of hair and so on as its objective support arises in somebody with a visual distortion, and then later on does not arise, you say sight has become clear.

source: དེ་བཞིན་དུ་འདིར་ཡང་གཟུགས་ལ་སོགས་པ་ལ་དམིགས་པའི་རྣམ་པར་ཤེས་པ་རྣམས་མི་འབྱུང་བའི་ཕྱིར་སྟོན་པ་ཞེས་བྱ་བའི་མིང་དུ་འགྱུར་རོ།
en: Similarly, here too, there is the locution “it reveals” because “consciousness and so on with form as objective support does not arise.” “

source: །བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་བར་སྟོན་ཏོ་ཞེས་བྱ་བ་ནི་དེ་བཞིན་ཉིད་རྟོག་གེའི་སྤྱོད་ཡུལ་ལས་ཡང་དག་པར་འདས་པའི་ཕྱིར་རོ།
en: Reveals… [that the world] is inconceivable”— because suchness is beyond the range of speculative thought. “

source: །རབ་འབྱོར་གཟུགས་ནི་བསམ་གྱིས་མི་ཁྱབ། གཞལ་དུ་མེད། དཔག་ཏུ་མེད། གྲངས་མེད་ཅིང་མི་མཉམ་པ་དང་མཉམ་པ་སྟེ་སྣང་བ་མེད་པའོ་ཞེས་བྱ་བ་ནི་གཟུགས་ན་སྣང་བ་མེད་པ་སྟེ་ཅིའི་ཕྱིར་ཞེ་ན་ཀུན་བརྟགས་པའི་གཟུགས་ནི་རི་བོང་གི་རྭ་བཞིན་དུ་མེད་པའི་ཕྱིར་སྣང་བ་མེད་དོ།
en: Subhūti, form is inconceivable, incomparable, immeasurable, uncountable, and equal to the unequaled because it does not appear.” “

source: །ཆོས་ཉིད་ཀྱི་གཟུགས་ནི་རྣམ་པར་ཤེས་པ་གང་གིས་ཀྱང་གཟུང་བར་མི་ནུས་པའི་ཕྱིར་སྣང་བ་མེད་དེ།
en: Form” does not appear.

source: གང་གི་ཕྱིར་དེ་ལྟར་སྣང་བ་མེད་པ་དེའི་ཕྱིར་བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་གཞལ་དུ་མེད་ཅེས་བྱ།
en: And why? Falsely imagined form does not exist, like a rabbit’s horns, so “it does not appear”; the true dharmic nature of form cannot be apprehended by any consciousness so “it does not appear,” and because it thus does not appear it is therefore “inconceivable,” “incomparable,” “immeasurable,” and so on.

source: དཔག་ཏུ་མེད་ཅེས་བྱ་བ་ལ་སོགས་པའོ། །བསམ་གྱིས་མི་ཁྱབ་པ་ལ་སོགས་པ་བསྟན་པ་ནི་གཞུང་ལས་འབྱུང་བ་བཞིན་དུ་བརྡ་ཕྲད་སླའོ།
en: The teaching about “inconceivable” and so on is easy to understand as found in the scripture.

source: །དེ་ལ་ནི་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་ཀྱང་མི་དམིགས་སོ་ཞེས་བྱ་བ་ནི་སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་ཀྱིས་གཟུང་དུ་མེད་ཅེས་བྱ་བའི་ཐ་ཚིག་སྟེ། དེ་བས་ན་སྣང་བ་མེད་པ་ཞེས་བྱ་བ་གསུངས་སོ།
en: In it, “all mental and mental factor dharmas are not apprehended” means cannot be grasped by “all mental and mental factor dharmas,” so it says that “it does not appear.”
